---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.AirSystemData.HeatingCoilType
source: html/88cb5514-1aa3-4501-40fe-412e7db40848.htm
---
# Autodesk.Revit.DB.Mechanical.AirSystemData.HeatingCoilType Property

The heating coil type. Note this property change would reset the heating water loop.

## Syntax (C#)
```csharp
public AirHeatingCoilType HeatingCoilType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration